//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include <tchar.h>
#include <math.h>
#include <iostream.h>
#include <conio.h>
#include <windows.h>
//---------------------------------------------------------------------------

#pragma argsused
int _tmain(int argc, _TCHAR* argv[])
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int a,b,c,s,f,d,m,t,x;
	float n,h,w,r;
	cout<<"s=";
	cin>>s;
	if(s>99 && s<1000){
		cout<<"\nВведенное число является трехзначным";
		a=s/100;
		b=s%100;
		c=b%10;
		b=b/10;
		if(pow(s,2)== pow((a+b+c),3) ){
			cout<<"\n Результат задания: True";
		}
		else cout<<"\n Результат задания: False";
	}
	else
		cout<<"\nВведенное число не удовлетворяет условиям задачи";

		  cout<<"\nf=";
		  cin>>f;
	   if(f>999 && f<10000) {
			 cout<<"\nВведенное число является четырехзначным";
		  a=f/1000;
		  b=f%1000;
		  b=b/100;
		  x=f%100;
		  c=x/10;
		  d=x%10;
	  if( (a+b) == (c+d)) {
		  cout<<"\n Результат задания: True";
	}
	 else
		  cout<<"\n Результат задания: False";
	  }
		 else
				cout<<"Введенное число не удовлетворяет условиям задачи";
		cout<<"\nm=";
		cin>>m;
	  if(m>99 && m<1000) {
		 cout<<"\nВведенное число является трехзначным";
		a=m/100;
		b=m%100;
		c=b%10;
		b=b/10;
		  if(a==b || a==c || b==c) {
			  cout<<"\n Результат задания: True";
		  }
			  else cout<<"\n Результат задания: False";
	   }
	    else
				cout<<"Введенное число не удовлетворяет условиям задачи";
			cout<<"\nn=";
			cin>>n;
		  h=(int)n;
		  w=n-h;
		  r=w*1000;
		  t=(int)r;
	  if(t>99 && t<1000) {
		 cout<<"\nВведенное число является трехзначным";
		a=t/100;
		b=t%100;
		c=b%10;
		b=b/10;
		   if(a==0 || b==0 || c==0) {
			   cout<<"\nРезультат задания: True";
		   }
				else cout<<"\nРезультат задания: False";
	  }
				else
					cout<<"Введенное число не удовлетворяет условиям задачи";
	getch();

	return 0;
}
//---------------------------------------------------------------------------
