//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include <tchar.h>
#include <windows.h>
#include <iostream.h>
#include <conio.h>
#include <math.h>
//---------------------------------------------------------------------------

#pragma argsused
int _tmain(int argc, _TCHAR* argv[])
{
  float a,b,c;
	 SetConsoleCP(1251);
	 SetConsoleOutputCP(1251);
cout<<"a=";
cin>>a;
cout<<"b=";
cin>>b;
cout<<"c=";
cin>>c;
   if(a>1 && a<3) cout<<"\nВведенное число a принадлежит заданном интервалу (1;3)";
	  else cout<<"\nВведенное число a не принадлежит заданному интервалу (1;3)";
   if(b>1 && b<3) cout<<"\nВведенное число b принадлежит заданном интервалу (1;3)";
	  else cout<<"\nВведенное число b не принадлежит заданному интервалу (1;3)";
   if(c>1 && c<3) cout<<"\nВведенное число c принадлежит заданном интервалу (1;3)";
	  else cout<<"\nВведенное число c не принадлежит заданному интервалу (1;3)";
	  getch();
	return 0;
}
//---------------------------------------------------------------------------
